//RightAssignment

#include <iostream>
#include <fstream>
#include <string>
#include <iomanip>

using namespace std;

int main() {
	ifstream input("input.txt");

	int n, m;
	input >> n >> m;

	// §á§Ö§â§Ö§Ò§Ú§â§Ñ§Ö§Þ §ã§ä§â§à§Ü§Ú
	for (int i = 0; i < n; ++i) {
		// §á§Ö§â§Ö§Ò§Ú§â§Ñ§Ö§Þ §ã§ä§à§Ý§Ò§è§í
		for (int j = 0; j < m; ++j) {
			// §ã§é§Ú§ä§í§Ó§Ñ§Ö§Þ §à§é§Ö§â§Ö§Õ§ß§à§Ö §é§Ú§ã§Ý§à
			int x;
			input >> x;
			// §á§â§à§á§å§ã§Ü§Ñ§Ö§Þ §ã§Ý§Ö§Õ§å§ð§ë§Ú§Û §ã§Ú§Þ§Ó§à§Ý
			input.ignore(1);
			// §Ó§í§Ó§à§Õ§Ú§Þ §é§Ú§ã§Ý§à §Ó §á§à§Ý§Ö §ê§Ú§â§Ú§ß§í 10
			cout << setw(10) << x;
			// §Ó§í§Ó§à§Õ§Ú§Þ §á§â§à§Ò§Ö§Ý, §Ö§ã§Ý§Ú §ä§à§Ý§î§Ü§à §ï§ä§à§ä §ã§ä§à§Ý§Ò§Ö§è §ß§Ö §á§à§ã§Ý§Ö§Õ§ß§Ú§Û
			if (j != m - 1) {
				cout << " ";
			}
		}
		// §Ó§í§Ó§à§Õ§Ú§Þ §á§Ö§â§Ö§Ó§à§Õ §ã§ä§â§à§Ü§Ú, §Ö§ã§Ý§Ú §ä§à§Ý§î§Ü§à §ï§ä§Ñ §ã§ä§â§à§Ü§Ñ §ß§Ö §á§à§ã§Ý§Ö§Õ§ß§ñ§ñ
		if (i != n - 1) {
			cout << endl;
		}
	}

	return 0;
}