#include <iostream>
#include <exception>
#include <string>
using namespace std;

string AskTimeServer() {
	/* §¥§Ý§ñ §ä§Ö§ã§ä§Ú§â§à§Ó§Ñ§ß§Ú§ñ §á§à§Ó§ã§ä§Ñ§Ó§Ý§ñ§Û§ä§Ö §ã§ð§Õ§Ñ §Ü§à§Õ, §â§Ö§Ñ§Ý§Ú§Ù§å§ð§ë§Ú§Û §â§Ñ§Ù§Ý§Ú§é§ß§à§Ö §á§à§Ó§Ö§Õ§Ö§ß§Ú§Ö §ï§ä§à§Û §æ§å§ß§Ü§Ú§Ú:
	* §ß§à§â§Þ§Ñ§Ý§î§ß§í§Û §Ó§à§Ù§Ó§â§Ñ§ä §ã§ä§â§à§Ü§à§Ó§à§Ô§à §Ù§ß§Ñ§é§Ö§ß§Ú§ñ
	* §Ó§í§Ò§â§à§ã §Ú§ã§Ü§Ý§ð§é§Ö§ß§Ú§ñ system_error
	* §Ó§í§Ò§â§à§ã §Õ§â§å§Ô§à§Ô§à §Ú§ã§Ü§Ý§ð§é§Ö§ß§Ú§ñ §ã §ã§à§à§Ò§ë§Ö§ß§Ú§Ö§Þ.
	*/
}

class TimeServer {
public:
	string GetCurrentTime() {
		/* §²§Ö§Ñ§Ý§Ú§Ù§å§Û§ä§Ö §ï§ä§à§ä §Þ§Ö§ä§à§Õ:
		* §Ö§ã§Ý§Ú AskTimeServer() §Ó§Ö§â§ß§å§Ý§Ñ §Ù§ß§Ñ§é§Ö§ß§Ú§Ö, §Ù§Ñ§á§Ú§ê§Ú§ä§Ö §Ö§Ô§à §Ó LastFetchedTime §Ú §Ó§Ö§â§ß§Ú§ä§Ö
		* §Ö§ã§Ý§Ú AskTimeServer() §Ò§â§à§ã§Ú§Ý§Ñ §Ú§ã§Ü§Ý§ð§é§Ö§ß§Ú§Ö system_error, §Ó§Ö§â§ß§Ú§ä§Ö §ä§Ö§Ü§å§ë§Ö§Ö §Ù§ß§Ñ§é§Ö§ß§Ú§Ö
		§á§à§Ý§ñ LastFetchedTime
		* §Ö§ã§Ý§Ú AskTimeServer() §Ò§â§à§ã§Ú§Ý§Ñ §Õ§â§å§Ô§à§Ö §Ú§ã§Ü§Ý§ð§é§Ö§ß§Ú§Ö, §á§â§à§Ò§â§à§ã§î§ä§Ö §Ö§Ô§à §Õ§Ñ§Ý§î§ê§Ö.
		*/
	}

private:
	string LastFetchedTime = "00:00:00";
};

int main() {
	// §®§Ö§ß§ñ§ñ §â§Ö§Ñ§Ý§Ú§Ù§Ñ§è§Ú§ð §æ§å§ß§Ü§è§Ú§Ú AskTimeServer, §å§Ò§Ö§Õ§Ú§ä§Ö§ã§î, §é§ä§à §ï§ä§à §Ü§à§Õ §â§Ñ§Ò§à§ä§Ñ§Ö§ä §Ü§à§â§â§Ö§Ü§ä§ß§à
	TimeServer ts;
	try {
		cout << ts.GetCurrentTime() << endl;
	}
	catch (exception& e) {
		cout << "Exception got: " << e.what() << endl;
	}
	return 0;
}